from aiogram.utils.emoji import emojize


about_us_text = emojize(
    ":grey_question: <b>О нас</b>\n\n"
    "Наш проект создан для помощи в быстром и комфортном поиске.\n"
    "Теперь не понадобятся значительные траты времени и сил для идеального досуга.\n\n"
    "Структура нашего сервиса проектировалась для удобства работы каждого пользователя - "
    "теперь выбор может быть быстрее и проще.\n\n"
    "Зачем вам дополнительные трудности на пути к удовольствию?\n\n"
    "Отдельного внимания заслуживает то, "
    "что мы оставляем за клиентом право полной анонимности и не требуем персональные данные."
)
